tutorials/multiphase/twoPhaseHouimOranFoam/shockTube/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air water);
relaxation
{
    instantRelaxation       yes;
    pressureRelaxationTime  5e-4;
}

air
{
    type            fluid;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha       1e-6;
    residualRho         1e-6;
}

water
{
    type            liquid;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha       1e-6;
    residualRho         1e-6;
}

blending
{
    default
    {
        type            none;
        dispersedPhase  air;
        continuousPhase water;
        maxFullyDispersedAlpha.air 0.3;
        maxPartlyDispersedAlpha.air 0.5;
        maxFullyDispersedAlpha.water 0.3;
        maxPartlyDispersedAlpha.water 0.5;
    }
}

sigma
(
    (air and water)     0.07
);

aspectRatio
(
);

drag
(
//     (air in water)
//     {
//         type            SchillerNaumann;
//         residualRe      1e-3;
//         swarmCorrection
//         {
//             type        none;
//         }
//     }
//
//     (water in air)
//     {
//         type            SchillerNaumann;
//         residualRe      1e-3;
//         swarmCorrection
//         {
//             type        none;
//         }
//     }
);

virtualMass
(
);

heatTransfer
(
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
