tutorials/multiphase/twoPhaseHouimOranFoam/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alpha1  0.25;    alpha2  0.1;
p1      2e7;    p2      1e7;
T1      308.15; T2      308.15;

defaultFieldValues
(
    volScalarFieldValue alpha.air $alpha2
    volVectorFieldValue U.air (0 0 0)
    volVectorFieldValue U.water (0 0 0)
    volScalarFieldValue T.air $T2
    volScalarFieldValue T.water $T2
    volScalarFieldValue p $p2
);

regions
(
    boxToCell
    {
        box (0 -1 -1) (5 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.air $alpha1
            volScalarFieldValue T.air $T1
            volScalarFieldValue T.water $T1
            volScalarFieldValue p $p1
        );
    }
);


// ************************************************************************* //
